# ── Brews ─────────────────────────────────────────
tap "Franvy/gtab"

# Shell
brew "fish"

# Dev tools
brew "bat"
brew "gtab" # run `gtab init` once after install
brew "libpq"
brew "libyaml"
brew "starship"

# ── Casks ─────────────────────────────────────────

# Terminal
cask "ghostty"

# AI
cask "claude-code"

# Editors
cask "visual-studio-code"
cask "zed"

# Productivity
cask "obsidian"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspice-nerd-font"

# Browsers
cask "chromium"
cask "zen"

# Containers
cask "orbstack"

# CLI tools
cask "1password-cli"
