IS_WSL2 = OS.linux? && (File.read("/proc/version").downcase.include?("microsoft") rescue false)

# Terminal
if OS.mac?
  cask "ghostty"
end

# Fonts
if OS.mac?
  cask "font-jetbrains-mono-nerd-font"
end

# Core dotfiles utility
brew "stow"

# General utilities
brew "unar"
brew "bfs"
brew "fzf"

# Git tooling (required by lazygit config)
brew "gh"
brew "lazygit"
brew "git-delta"
brew "difftastic"
brew "bfg"

# Dev tools
brew "mise"
brew "libpq"

# Containers
if OS.mac?
  cask "orbstack"
end

# Editors
if OS.mac?
  cask "zed"
end

# AI
if OS.mac?
  cask "claude-code"
end

# Shell tools
brew "eza"
